#!/bin/bash

echo
echo
echo -e "\e[1;33m>  calc         -[  Приложение выполняет функции калькулятора ]\e[0m"
echo -e "\e[1;33m>  search       -[  Приложение производит поиск файлов в директории\e[0m"
echo -e "\e[1;33m>  reverse      -[  Приложение в обратном порядке записывает содержимое файла в другой файл ]\e[0m"
echo -e "\e[1;33m>  strlen       -[  Приложение выводит кол-во символов в строке ] \e[0m" 
echo -e  "\e[1;33m>  log          -[  Приложение выводит предупреждения и информационные сообщения] \e[0m"
echo -e "\e[1;33m>  exit         -[  Приложение завершает работу с кодом возврата ]\e[0m " 
echo -e "\e[1;33m>  interactive  -[  Приложение переходит в интерактивный режим] \e[0m" 
echo
echo
