#!/bin/bash

if [[ $# -gt 0 ]]
then
	
	echo -e "\e[1;31mЗдесь не нужны аргументы\e[0m ">&2
	exit -3
fi


echo
echo
echo -e "\e[1;31m****************************************************************************************************   \e[0m " 
echo -e "\e[1;33m>  calc         -[  Приложение выполняет функции калькулятора ]\e[0m"
echo -e "\e[1;33m>  calc         -[  Аргументы: 1) Действие 2) 1-ое число 3) 2-ое число ]\e[0m"
echo -e "\e[1;33m>  search       -[  Приложение производит поиск строк в файлах в директории\e[0m"
echo -e "\e[1;33m>  search       -[  Аргументы: 1) Директория 2) строка ]\e[0m"
echo -e "\e[1;33m>  reverse      -[  Приложение в обратном порядке записывает содержимое файла в другой файл ]\e[0m"
echo -e "\e[1;33m>  reverse      -[  Аргументы: 1) 1-ый файл 2) 2-ой файл ]\e[0m"
echo -e "\e[1;33m>  strlen       -[  Приложение выводит кол-во символов в строке ] \e[0m" 
echo -e "\e[1;33m>  strlen       -[  Аргументы: 1) Текст\e[0m"
echo -e "\e[1;33m>  log          -[  Приложение выводит предупреждения и информационные сообщения] \e[0m"
echo -e "\e[1;33m>  log          -[  Аргументов нет ]\e[0m"
echo -e "\e[1;33m>  exit         -[  Приложение завершает работу с кодом возврата ]\e[0m " 
echo -e "\e[1;33m>  exit         -[  Аргументы: 1) Код возврата\e[0m"
echo -e "\e[1;33m>  interactive  -[  Приложение переходит в интерактивный режим] \e[0m" 
echo -e "\e[1;33m>  interactive  -[  Нет Аргументов]\e[0m"
 
echo -e "\e[1;31m****************************************************************************************************   \e[0m " 



echo -e "\e[36m##Коды возврата## \e[0m"
echo
echo
echo -e "\e[36m exit  0 - Все правильно\e[0m"
echo -e "\e[36m exit -1 - Осбенности действий\e[0m"
echo -e "\e[36m exit -2 - Проблема с аргументами\e[0m"
echo -e "\e[36m exit -3 - Неправильное кол-во аргументов\e[0m"
echo -e "\e[36m exit -4 - Не существует директории/файл\e[0m"
echo -e "\e[36m exit -5 - Действия нет\e[0m"
echo -e "\e[1;31m****************************************************************************************************   \e[0m " 
echo
echo
